CSI API ETABS v1
cFrameObj.GetMass Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMass(
	string Name,
	ref double MassOverL
)
Function GetMass (
	Name As String,
	ByRef MassOverL As Double
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MassOverL As Double
Dim returnValue As Integer
returnValue = instance.GetMass(Name, MassOverL)
int GetMass(
	String^ Name,
	double% MassOverL
)
abstract GetMass :
        Name : string *
        MassOverL : float byref -> int
Parameters
Name
Type: System.String
MassOverL
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace